.svn/pristine/d2/d21fcbf208734141d80d90677d4ba415b0e12c67.svn-base

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:checkInAndPayWithPayType
			xmlns:ns2="http://framework.facade.common.transcore.pinganfu.com/">
			<arg0>  <!--话费充值 -->
				<busiChannel>P</busiChannel>
				<customerId>1000010000026540</customerId> 
				<customerName>二维码商户</customerName>
				<dcFlag>C</dcFlag>
				<extFeilds>{"mobile":"15000956051"}</extFeilds>
				<orderNo>${orderNo}</orderNo>
				<paymentMode>8388609</paymentMode>
				<productCode>100010020000</productCode>
				<registerFlag>0</registerFlag>
				<subLedgerFlag>0</subLedgerFlag>
				<toCustomerId>1000010000000734</toCustomerId>00
				<tranDetails>
					<currencyCode>CNY</currencyCode>
					<payAcctId>801</payAcctId>
					<payAmt>100000</payAmt>
					<payType>23</payType>
				</tranDetails>
				<tranDetails>
					<currencyCode>CNY</currencyCode>
					<payAcctId>801</payAcctId>
					<payAmt>200000</payAmt>
					<payType>00</payType>
				</tranDetails>
				<transAmt>300000</transAmt>
				<transFactAmt>300000</transFactAmt>
				<transType>12</transType>
			</arg0>
		</ns2:checkInAndPayWithPayType>
	</soap:Body>
</soap:Envelope>